app/controllers/teams_controller.rb

  def search
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "gamesPlayed", "wins", "losses", "otLosses", "points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "sadsa"], ["gamesPlayed", 1], ["wins", 1], ["losses", 1], ["otLosses", 1], ["points", 1], ["created_at", "2015-03-26 02:09:56.672875"], ["updated_at", "2015-03-26 02:09:56.672875"]]

  def update
    respond_to do |format|
      if @team.update(team_params)
---
UPDATE "teams" SET "gamesPlayed" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["gamesPlayed", 75], ["updated_at", "2015-03-26 01:42:10.636048"], ["id", 1]]

  def destroy
    @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]

    def set_team
      begin
        @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", nil]]